РемонтПК_Конфигурация/src/Documents/АктВыполненныхРабот/АктВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктВыполненныхРабот</name>
  <registerRecords>AccumulationRegister.ЗагруженностьСпециалистов</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиЗапчастей</registerRecords>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Специалисты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.ТоварыНаСкладе</types>
        <types>CatalogRef.КаталогУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РемонтПК_Конфигурация/src/Documents/АктВыполненныхРабот/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаявкаПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Заявка) Тогда
		ДанныеЗаявки      = Объект.Заявка.ПолучитьОбъект();
		Объект.Клиент     = ДанныеЗаявки.Клиент;
		Объект.Специалист = ДанныеЗаявки.Специалист;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)
	ЗаявкаПриИзмененииНаСервере();
КонецПроцедуры



&НаКлиенте
Процедура РаботыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Работы.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Стоимость;
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура РаботыСтоимостьПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Работы.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Стоимость;
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСумму()
	Объект.Сумма = 0;
	Для Каждого Строка Из Объект.Работы Цикл
		Объект.Сумма = Объект.Сумма + Строка.Сумма;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РаботыНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Работы.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТЧ.Стоимость = РаботыПолучитьСтоимостьНаСервере(
		СтрокаТЧ.Номенклатура);
КонецПроцедуры

&НаСервере
Функция РаботыПолучитьСтоимостьНаСервере(Номенклатура)
	Если ТипЗнч(Номенклатура) = 
			Тип("СправочникСсылка.КаталогУслуг") Тогда
		Возврат Номенклатура.Стоимость;
		
	ИначеЕсли ТипЗнч(Номенклатура) = 
			Тип("СправочникСсылка.ТоварыНаСкладе") Тогда
		Возврат Номенклатура.Стоимость;
	КонецЕсли;
	
	Возврат 0;
КонецФункции
